In [1]:
import pandas as pd
pd.__version__

'0.25.3'

In [2]:
arr = [0, 1, 2, 3, 4]
df = pd.Series(arr) # create Series from a list
df

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [3]:
d = {'a':1,'b':2,'c':3,'d':4,'e':5}
df = pd.Series(d) # create Series from dict
df

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
import numpy as np
dates = pd.date_range('today', periods=6)
num_arr = np.random.randn(6, 4)
columns = ['A', 'B', 'C', 'D']
df = pd.DataFrame(num_arr, index=dates, columns=columns)
df

                                   A         B         C         D
2020-01-12 02:49:50.371732  2.229447 -0.166759  0.141379 -0.770397
2020-01-13 02:49:50.371732 -0.102119  0.803587 -1.026556 -1.977628
2020-01-14 02:49:50.371732 -0.059391  0.893011  1.616512 -0.793829
2020-01-15 02:49:50.371732 -1.067736 -0.571094  0.680974 -0.889725
2020-01-16 02:49:50.371732 -0.207103  0.612379  0.592375 -1.145236
2020-01-17 02:49:50.371732 -0.713340  1.547604 -0.004584 -0.724361

In [0]:
# create DataFrame from CSV
df = pd.read_csv('test.csv', encoding='gbk', sep=';')

In [5]:
# create DataFrame from dictionary
import numpy as np
data = {
    'animal':
    ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority':
    ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [6]:
df.info()
# df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
animal      10 non-null object
age         8 non-null float64
visits      10 non-null int64
priority    10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [7]:
# show the first three rows of df
df.iloc[:3]
# df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [8]:
df.loc[:, ['animal', 'age']]
# df[['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [9]:
df.loc[df.index[[3, 4, 8]], ['animal', 'age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [10]:
df[df['age'] > 3]

  animal  age  visits priority
e    dog  5.0       2       no
g  snake  4.5       1       no
i    dog  7.0       2       no

In [11]:
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [12]:
df[(df['age']>2) & (df['age']>4)]
# df[df['age'].between(2, 4)]

  animal  age  visits priority
e    dog  5.0       2       no
g  snake  4.5       1       no
i    dog  7.0       2       no

In [0]:
# change the age in line f to 1.5
df.loc['f', 'age'] = 1.5

In [14]:
df['visits'].sum()

19

In [15]:
# calculate the average age of different kinds of animals
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

In [16]:
# insert new line k
df.loc['k'] = [5.5, 'dog', 'no', 2]
# delete line k
df = df.drop('k')
df

  animal  age visits priority
a    cat  2.5      1      yes
b    cat    3      3      yes
c  snake  0.5      2       no
d    dog  NaN      3      yes
e    dog    5      2       no
f    cat  1.5      3       no
g  snake  4.5      1       no
h    cat  NaN      1      yes
i    dog    7      2       no
j    dog    3      1       no

In [17]:
df['animal'].value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

In [18]:
df.sort_values(by=['age', 'visits'], ascending=[False, True])

  animal  age visits priority
i    dog    7      2       no
e    dog    5      2       no
g  snake  4.5      1       no
j    dog    3      1       no
b    cat    3      3      yes
a    cat  2.5      1      yes
f    cat  1.5      3       no
c  snake  0.5      2       no
h    cat  NaN      1      yes
d    dog  NaN      3      yes

In [19]:
# replace the "yes, no" value in the priority column with "True, False"
df['priority'] = df['priority'].map({'yes': True, 'no': False})
df

  animal  age visits  priority
a    cat  2.5      1      True
b    cat    3      3      True
c  snake  0.5      2     False
d    dog  NaN      3      True
e    dog    5      2     False
f    cat  1.5      3     False
g  snake  4.5      1     False
h    cat  NaN      1      True
i    dog    7      2     False
j    dog    3      1     False

In [20]:
# replace 'snake' in column animal with 'python'
df['animal'] = df['animal'].replace('snake', 'python')
df

   animal  age visits  priority
a     cat  2.5      1      True
b     cat    3      3      True
c  python  0.5      2     False
d     dog  NaN      3      True
e     dog    5      2     False
f     cat  1.5      3     False
g  python  4.5      1     False
h     cat  NaN      1      True
i     dog    7      2     False
j     dog    3      1     False

In [22]:
# delete the lines with duplicate values
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
print(df)
df1 = df.loc[df['A'].shift() != df['A']]
# df1 = df.drop_duplicates(subset='A')
print(df1)

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7
   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [23]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
print(df)
df1 = df.sub(df.mean(axis=1), axis=0)
print(df1)

          0         1         2
0  0.955810  0.033802  0.285656
1  0.373698  0.673750  0.038402
2  0.391339  0.298439  0.950254
3  0.086110  0.585844  0.100716
4  0.405929  0.307377  0.213914
          0         1         2
0  0.530721 -0.391288 -0.139433
1  0.011748  0.311800 -0.323548
2 -0.155338 -0.248239  0.403577
3 -0.171447  0.328287 -0.156840
4  0.096855 -0.001696 -0.095160

In [24]:
df = pd.DataFrame(np.random.random(size=(5, 5)), columns=list('abcde'))
print(df)
# find out which line has the smallest sum
df.sum().idxmin()

          a         b         c         d         e
0  0.377143  0.811268  0.060316  0.768315  0.701191
1  0.321827  0.528475  0.966460  0.001669  0.218260
2  0.079450  0.880126  0.214626  0.837830  0.806232
3  0.265648  0.793735  0.432535  0.649956  0.692283
4  0.245568  0.226688  0.275659  0.762482  0.352165

'a'

In [25]:
df = pd.DataFrame({'A': list('aaabbcaabcccbbc'),
                   'B': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
print(df)
df1 = df.groupby('A')['B'].nlargest(3).sum(level=0)
print(df1)

    A    B
0   a   12
1   a  345
2   a    3
3   b    1
4   b   45
5   c   14
6   a    4
7   a   52
8   b   54
9   c   23
10  c  235
11  c   21
12  b   57
13  b    3
14  c   87
A
a    409
b    156
c    345
Name: B, dtype: int64

In [26]:
df = pd.DataFrame({
    'A': [1, 2, 11, 11, 33, 34, 35, 40, 79, 99],
    'B': [1, 2, 11, 11, 33, 34, 35, 40, 79, 99]
})
print(df)
df1 = df.groupby(pd.cut(df['A'], np.arange(0, 101, 10)))['B'].sum()
print(df1)

    A   B
0   1   1
1   2   2
2  11  11
3  11  11
4  33  33
5  34  34
6  35  35
7  40  40
8  79  79
9  99  99
A
(0, 10]        3
(10, 20]      22
(20, 30]       0
(30, 40]     142
(40, 50]       0
(50, 60]       0
(60, 70]       0
(70, 80]      79
(80, 90]       0
(90, 100]     99
Name: B, dtype: int64

In [27]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
print(df)
df.unstack().sort_values()[-3:].index.tolist()

          0         1         2
0  0.722066  0.285554  0.693709
1  0.585250  0.206334  0.744564
2  0.580909  0.130108  0.790325
3  0.322578  0.370177  0.049574
4  0.398122  0.792170  0.644236

[(2, 1), (2, 2), (1, 4)]